Repository: yoko-at-home/reactjs-docs-TM
Catalog: docs/uncontrolled-components_EN-US_ja.tmx
Source language: en_us
Languages: ja

source: --- id: uncontrolled-components title: Uncontrolled Components permalink: docs/uncontrolled-components.html ---
ja: --- id: uncontrolled-components title: 非制御コンポーネント permalink: docs/uncontrolled-components.html ---

source: In most cases, we recommend using [controlled components](/docs/forms.html#controlled-components) to implement forms.
ja: ほとんどの場合では、フォームの実装には[制御されたコンポーネント](/docs/forms.html#controlled-components) (controlled component) を使用することをお勧めしています。

source: In a controlled component, form data is handled by a React component.
ja: 制御されたコンポーネントでは、フォームのデータは React コンポーネントが扱います。

source: The alternative is uncontrolled components, where form data is handled by the DOM itself.
ja: 非制御コンポーネント (uncontrolled component) はその代替となるものであり、フォームデータを DOM 自身が扱います。

source: To write an uncontrolled component, instead of writing an event handler for every state update, you can [use a ref](/docs/refs-and-the-dom.html) to get form values from the DOM.
ja: 非制御コンポーネントを記述するには、各 state の更新に対してイベントハンドラを書く代わりに、[ref を使用](/docs/refs-and-the-dom.html)して DOM からフォームの値を取得します。

source: For example, this code accepts a single name in an uncontrolled component:
ja: 例えば、以下のコードは非制御コンポーネントで 1 つの名前を受け取ります：

source: [**Try it on CodePen**](https://codepen.io/gaearon/pen/WooRWa?editors=0010)
ja: [**CodePen で試す**](https://codepen.io/gaearon/pen/WooRWa?editors=0010)

source: Since an uncontrolled component keeps the source of truth in the DOM, it is sometimes easier to integrate React and non-React code when using uncontrolled components.
ja: 非制御コンポーネントでは DOM に信頼できる情報源 (source of truth) を保持するため、使用すれば React と非 React のコードの統合が簡単になることがあります。

source: It can also be slightly less code if you want to be quick and dirty.
ja: 汚くても構わないので速く記述したいと思うなら少しだけコード量も減らせます。

source: Otherwise, you should usually use controlled components.
ja: そうでなければ、通常の制御されたコンポーネントを使用するべきです。

source: If it's still not clear which type of component you should use for a particular situation, you might find [this article on controlled versus uncontrolled inputs](https://goshakkk.name/controlled-vs-uncontrolled-inputs-react/) to be helpful.
ja: 特定の状況に対してどちらのタイプのコンポーネントを使用すれば良いかまだはっきりしない場合は、[制御された入力 vs 非制御入力の記事](https://goshakkk.name/controlled-vs-uncontrolled-inputs-react/)が参考になるでしょう。

source: ### Default Values {#default-values}
ja: ### デフォルト値 {#default-values}

source: In the React rendering lifecycle, the `value` attribute on form elements will override the value in the DOM.
ja: React のレンダーのライフサイクルでは、フォーム要素の `value` 属性は DOM の値を上書きします。

source: With an uncontrolled component, you often want React to specify the initial value, but leave subsequent updates uncontrolled.
ja: 非制御コンポーネントでは、React に初期値を指定させるが後続の更新処理には関与しないようにしたいことがよくあるでしょう。

source: To handle this case, you can specify a `defaultValue` attribute instead of `value`.
ja: このケースを扱うために、`value` の代わりに `defaultValue` 属性を指定できます。

source: Changing the value of `defaultValue` attribute after a component has mounted will not cause any update of the value in the DOM.
ja: コンポーネントのマウント後に `defaultValue` 属性の値を変更しても DOM 内の値の更新は引き起こされません。

source: Likewise, `<input type="checkbox">` and `<input type="radio">` support `defaultChecked`, and `<select>` and `<textarea>` supports `defaultValue`.
ja: 同様に、`<input type="checkbox">` と `<input type="radio">` が `defaultChecked` を、そして `<select>` と `<textarea>` が `defaultValue` をサポートしています。

source: ## The file input Tag {#the-file-input-tag}
ja: ## ファイル input タグ {#the-file-input-tag}

source: In HTML, an `<input type="file">` lets the user choose one or more files from their device storage to be uploaded to a server or manipulated by JavaScript via the [File API](https://developer.mozilla.org/en-US/docs/Web/API/File/Using_files_from_web_applications).
ja: HTML では、`<input type="file">` を利用してユーザに 1 つ以上のファイルをデバイスストレージから選択させ、サーバにアップロードしたり [File API](https://developer.mozilla.org/en-US/docs/Web/API/File/Using_files_from_web_applications) を通じて JavaScript で操作したりします。

source: In React, an `<input type="file" />` is always an uncontrolled component because its value can only be set by a user, and not programmatically.
ja: React では、`<input type="file" />` は値がユーザだけが設定できるものでありプログラムでは操作できないため、常に非制御コンポーネントです。

source: You should use the File API to interact with the files.
ja: ファイルをやり取りするのに File API を使用してください。

source: The following example shows how to create a [ref to the DOM node](/docs/refs-and-the-dom.html) to access file(s) in a submit handler:
ja: 以下の例では [DOM ノードへの ref](/docs/refs-and-the-dom.html) を作成し submit ハンドラでファイルにアクセスしています。

source: [](codepen://uncontrolled-components/input-type-file)
ja: **[CodePen で試す](codepen://uncontrolled-components/input-type-file)**
